ld3003/easyio/bsp/EasyIO_stm32l1xx/drivers/bootloader_usart.c
/*
 * File      : usart.c
 * This file is part of RT-Thread RTOS
 * COPYRIGHT (C) 2006-2013, RT-Thread Development Team
 *
 * The license and distribution terms for this file may be
 * found in the file LICENSE in this distribution or at
 * http://www.rt-thread.org/license/LICENSE
 *
 * Change Logs:
 * Date           Author       Notes
 * 2009-01-05     Bernard      the first version
 * 2010-03-29     Bernard      remove interrupt Tx and DMA Rx mode
 * 2013-05-13     aozima       update for kehong-lingtai.
 */

#include "stm32l1xx.h"
//#include "stm32l1xx.h"
#include "usart.h"
#include "board.h"
#include "gnss.h"

#include <rtdevice.h>

#undef RT_USING_UART2
#undef RT_USING_UART3

/* USART1 */
#define UART1_GPIO_TX		GPIO_Pin_9
#define UART1_GPIO_RX		GPIO_Pin_10
#define UART1_GPIO			GPIOA

/* USART2 */
#define UART2_GPIO_TX	    GPIO_Pin_2
#define UART2_GPIO_RX	    GPIO_Pin_3
#define UART2_GPIO	    	GPIOA

/* USART3_REMAP[1:0] = 00 */
#define UART3_GPIO_TX		GPIO_Pin_10
#define UART3_GPIO_RX		GPIO_Pin_11
#define UART3_GPIO_CTS		GPIO_Pin_13
#define UART3_GPIO_RTS		GPIO_Pin_14
#define UART3_GPIO			GPIOB

/* STM32 uart driver */
struct stm32_uart
{
    USART_TypeDef* uart_device;
    IRQn_Type irq;
};


unsigned char UART3_USE_DMA_FLAG = 0;
unsigned char UART2_USE_DMA_FLAG = 1;

#define UART3_USE_DMA			UART3_USE_DMA_FLAG
#define UART2_USE_DMA			UART2_USE_DMA_FLAG

struct SERIAL_CFG{
	unsigned char flag;
	struct rt_serial_device *device;
	struct serial_configure *cfg;
};

struct SERIAL_CFG serial_cfg[3] = {0,0,0,0,0,0,0,0,0};
static rt_err_t stm32_configure(struct rt_serial_device *serial, struct serial_configure *cfg);

static unsigned int uart2_recv_length = 0;



#include <rthw.h>
#include <rtthread.h>
#include <rtdevice.h>

rt_inline void serial_ringbuffer_init(struct serial_ringbuffer *rbuffer)
{
    rt_memset(rbuffer->buffer, 0, sizeof(rbuffer->buffer));
    rbuffer->put_index = 0;
    rbuffer->get_index = 0;
}

rt_inline void serial_ringbuffer_putc(struct serial_ringbuffer *rbuffer,
                                      char                      ch)
{
    rt_base_t level;

    /* disable interrupt */
    level = rt_hw_interrupt_disable();

    rbuffer->buffer[rbuffer->put_index] = ch;
    rbuffer->put_index = (rbuffer->put_index + 1) & (RT_SERIAL_RB_BUFSZ - 1);

    /* if the next position is read index, discard this 'read char' */
    if (rbuffer->put_index == rbuffer->get_index)
    {
        rbuffer->get_index = (rbuffer->get_index + 1) & (RT_SERIAL_RB_BUFSZ - 1);
    }

    /* enable interrupt */
    rt_hw_interrupt_enable(level);
}

rt_inline int serial_ringbuffer_putchar(struct serial_ringbuffer *rbuffer,
                                        char                      ch)
{
    rt_base_t level;
    rt_uint16_t next_index;

    /* disable interrupt */
    level = rt_hw_interrupt_disable();

    next_index = (rbuffer->put_index + 1) & (RT_SERIAL_RB_BUFSZ - 1);
    if (next_index != rbuffer->get_index)
    {
        rbuffer->buffer[rbuffer->put_index] = ch;
        rbuffer->put_index = next_index;
    }
    else
    {
        /* enable interrupt */
        rt_hw_interrupt_enable(level);

        return -1;
    }

    /* enable interrupt */
    rt_hw_interrupt_enable(level);

    return 1;
}

rt_inline int serial_ringbuffer_getc(struct serial_ringbuffer *rbuffer)
{
    int ch;
    rt_base_t level;

    ch = -1;
    /* disable interrupt */
    level = rt_hw_interrupt_disable();
    if (rbuffer->get_index != rbuffer->put_index)
    {
        ch = rbuffer->buffer[rbuffer->get_index];
        rbuffer->get_index = (rbuffer->get_index + 1) & (RT_SERIAL_RB_BUFSZ - 1);
    }
    /* enable interrupt */
    rt_hw_interrupt_enable(level);

    return ch;
}

rt_inline rt_uint32_t serial_ringbuffer_size(struct serial_ringbuffer *rbuffer)
{
    rt_uint32_t size;
    rt_base_t level;

    level = rt_hw_interrupt_disable();
    size = (rbuffer->put_index - rbuffer->get_index) & (RT_SERIAL_RB_BUFSZ - 1);
    rt_hw_interrupt_enable(level);

    return size;
}

unsigned char Uart_Rx[UART_RX_LEN];
unsigned char Uart2_Rx[UART_RX_LEN];
unsigned short Uart_Rx_Length = 0;
unsigned short Uart2_Rx_Length = 0;
static struct rt_timer dma_rx_tmr;
static struct rt_timer dma2_rx_tmr;
static struct rt_serial_device *uart3dev;
static struct rt_serial_device *uart2dev;

//50ms
static void dma_rx_timeout(void *p)
{
	int i=0;
	unsigned int temp;
	unsigned char ch;
	struct rt_serial_device *serial = uart3dev;
	static unsigned short history_dma_buffer_length = 0;
	 
	temp = UART_RX_LEN - DMA_GetCurrDataCounter(DMA1_Channel3); 
	
	
	if (temp == 0)
	{
		history_dma_buffer_length = 0;
		return ;
	}
	
	
	if (history_dma_buffer_length > temp)
	{
		DMA_Cmd(DMA1_Channel3,DISABLE); 
		history_dma_buffer_length = 0;
		DMA_SetCurrDataCounter(DMA1_Channel3,UART_RX_LEN);
		DMA_Cmd(DMA1_Channel3,ENABLE); 
		
	}else
	if (temp > history_dma_buffer_length)
	{
		history_dma_buffer_length = temp;
	}else
	if (temp  == history_dma_buffer_length)
	{
		USART_Cmd(USART3, DISABLE);
		DMA_Cmd(DMA1_Channel3,DISABLE); 
		temp = UART_RX_LEN - DMA_GetCurrDataCounter(DMA1_Channel3); 
		
		//只有当DMA开启的时候才。。。
		if (UART3_USE_DMA == 1)
		{
			//
			for(i=0;i<temp;i++)
			{
				serial_ringbuffer_putc(serial->int_rx,Uart_Rx[i]);
				//
			}

			/* invoke callback */
			if (serial->parent.rx_indicate != RT_NULL)
			{
					rt_size_t rx_length;

					/* get rx length */
					rx_length = serial_ringbuffer_size(serial->int_rx);
					serial->parent.rx_indicate(&serial->parent, rx_length);
			}
			
		}	
			
		//clear counter
		history_dma_buffer_length = 0;
		
		DMA_SetCurrDataCounter(DMA1_Channel3,UART_RX_LEN);
		DMA_Cmd(DMA1_Channel3,ENABLE); 
		USART_Cmd(USART3, ENABLE);
	
	}		
}


//50ms
#include "app_ev.h"
#include "my_stdc_func/debugl.h"
static unsigned short history_dma_buffer_length2 = 0;
static unsigned short gnss_data_length = 0;
extern void put_gps_rawdata(unsigned char *xbuffer , unsigned int size);
static void __dma_process_gnss_data(void *p)
{
}

static void init_uart2_dma(void);
static void dma2_rx_timeout(void *p)
{
	int i=0;
	unsigned int temp;
	unsigned char ch;
	struct rt_serial_device *serial = uart2dev;
	
	
	static unsigned char dma_reset_cnt = 0;
	 
	temp = UART_RX_LEN - DMA_GetCurrDataCounter(DMA1_Channel6); 
	
	if (temp == 0)
	{
		history_dma_buffer_length2 = 0;
		return ;
	}
	
	
	if (history_dma_buffer_length2 > temp)
	{
		DMA_Cmd(DMA1_Channel6,DISABLE); 
		history_dma_buffer_length2 = 0;
		DMA_SetCurrDataCounter(DMA1_Channel6,UART_RX_LEN);
		DMA_Cmd(DMA1_Channel6,ENABLE); 
		
