ld3003/easyio/bsp/EasyIO_stm32l1xx/drivers/bootloader_usart.c
	}else
	if (temp > history_dma_buffer_length2)
	{
		history_dma_buffer_length2 = temp;
	}else
	if (temp  == history_dma_buffer_length2)
	{
		DMA_Cmd(DMA1_Channel6,DISABLE); 
		temp = UART_RX_LEN - DMA_GetCurrDataCounter(DMA1_Channel6); 
		
		//只有当DMA2启用的时候
		if (UART2_USE_DMA == 1)
		{
			//
			for(i=0;i<temp;i++)
			{
				serial_ringbuffer_putc(serial->int_rx,Uart2_Rx[i]);
				//
			}

			/* invoke callback */
			if (serial->parent.rx_indicate != RT_NULL)
			{
					rt_size_t rx_length;

					/* get rx length */
					rx_length = serial_ringbuffer_size(serial->int_rx);
					serial->parent.rx_indicate(&serial->parent, rx_length);
			}
		}
		
		
		
		//clear counter
		history_dma_buffer_length2 = 0;

		DMA_SetCurrDataCounter(DMA1_Channel6,UART_RX_LEN);
		DMA_Cmd(DMA1_Channel6,ENABLE); 
		//fuck


	}		
}

static void uart2_rx_timeout(void *p)
{
	static unsigned int history_gps_buffer_tmp_length = 0;
	
	//如果相等，说明没有再接收数据了
	if(history_gps_buffer_tmp_length == uart2_recv_length)
	{
		
		if (uart2_recv_length > 0)
		{
			
			Uart2_Rx_Length = uart2_recv_length;
			if (post_hw_int_event(__dma_process_gnss_data,0,0,0) == RT_EOK)
			{
				USART_ITConfig(USART2, USART_IT_RXNE, DISABLE);
			}else
			{
				//clear counter
				USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);
				
			}
		}
		
		//清空重新接收
		uart2_recv_length = 0;
	}
	
	history_gps_buffer_tmp_length = uart2_recv_length;
	//
}



void DMA1_Channel3_IRQHandler(void)
{
	static unsigned int LeftDataCounter;

	LeftDataCounter = DMA_GetCurrDataCounter(DMA1_Channel3);
	
	DMA_ClearFlag(DMA1_FLAG_TC3);
	DMA_ClearFlag(DMA1_FLAG_HT3);
	DMA_ClearFlag(DMA1_FLAG_TE3);
	DMA_ClearFlag(DMA1_FLAG_GL3);
}
static void init_uart3_dma_tmr(void)
{
	//50ms
	static unsigned char init_uart3_dma_tmr_flag = 0;
	if (init_uart3_dma_tmr_flag == 1)
		return;
	rt_timer_init(&dma_rx_tmr,"dma_tmr",dma_rx_timeout,0,5,RT_TIMER_FLAG_PERIODIC);
	rt_timer_start(&dma_rx_tmr);
	init_uart3_dma_tmr_flag = 1;
	
}
static void init_uart3_dma(void)
{


	NVIC_InitTypeDef NVIC_InitStructure;
	DMA_InitTypeDef DMA_InitStructure;

	//串口收DMA配置  
	//启动DMA时钟
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
	//DMA1通道5配置
	DMA_DeInit(DMA1_Channel3);
	//外设地址
	DMA_InitStructure.DMA_PeripheralBaseAddr = (u32)(&USART3->DR);
	//内存地址
	DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)Uart_Rx;
	//dma传输方向单向
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
	//设置DMA在传输时缓冲区的长度
	DMA_InitStructure.DMA_BufferSize = UART_RX_LEN;
	//设置DMA的外设递增模式，一个外设
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	//设置DMA的内存递增模式
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	//外设数据字长
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	//DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
	//内存数据字长
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	//设置DMA的传输模式
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
	//设置DMA的优先级别
	DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
	//设置DMA的2个memory中的变量互相访问
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
	DMA_Init(DMA1_Channel3,&DMA_InitStructure);

	
	DMA_Cmd(DMA1_Channel3,ENABLE);
	
	//采用DMA方式接收
	USART_DMACmd(USART3,USART_DMAReq_Rx,ENABLE);
	

}


static void init_uart2_dma_tmr(void)
{
	static unsigned char init_uart2_dma_tmr_flag = 0;
	if (init_uart2_dma_tmr_flag == 1)
		return;
	
	rt_timer_init(&dma2_rx_tmr,"dma2_tmr",dma2_rx_timeout,0,5,RT_TIMER_FLAG_PERIODIC);
	rt_timer_start(&dma2_rx_tmr);
	init_uart2_dma_tmr_flag = 1;
	//
}

static void init_uart2_it_tmr(void)
{
	
	static unsigned char init_uart2_it_tmr_flag = 0;
	if (init_uart2_it_tmr_flag == 1)
		return;
	//50ms
	rt_timer_init(&dma2_rx_tmr,"uart2_tmr",uart2_rx_timeout,0,5,RT_TIMER_FLAG_PERIODIC);
	rt_timer_start(&dma2_rx_tmr);
	init_uart2_it_tmr_flag = 1;
	//
}

static void init_uart2_dma(void)
{


	NVIC_InitTypeDef NVIC_InitStructure;
	DMA_InitTypeDef DMA_InitStructure;

	//串口收DMA配置  
	//启动DMA时钟
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
	//DMA1通道5配置
	DMA_DeInit(DMA1_Channel6);
	//外设地址
	DMA_InitStructure.DMA_PeripheralBaseAddr = (u32)(&USART2->DR);
	//内存地址
	DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)Uart2_Rx;
	//dma传输方向单向
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
	//设置DMA在传输时缓冲区的长度
	DMA_InitStructure.DMA_BufferSize = UART_RX_LEN;
	//设置DMA的外设递增模式，一个外设
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	//设置DMA的内存递增模式
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	//外设数据字长
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	//DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
	//内存数据字长
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	//设置DMA的传输模式
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
	//设置DMA的优先级别
	DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
	//设置DMA的2个memory中的变量互相访问
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
	DMA_Init(DMA1_Channel6,&DMA_InitStructure);

	
	DMA_Cmd(DMA1_Channel6,ENABLE);
	
	//采用DMA方式接收
	USART_DMACmd(USART2,USART_DMAReq_Rx,ENABLE);
	
	

}



void reinit_system_serial(void)
{
	int i=0;
	for(i=0;i<3;i++)
	{
		if (serial_cfg[i].flag == 1)
		{
			stm32_configure(serial_cfg[i].device,serial_cfg[i].cfg);
		}
	}
	//
}

//void reinit_uart3_baud(unsigned int baud)
//{
//	serial_cfg[2].cfg->baud_rate = baud;
//	stm32_configure(serial_cfg[2].device,serial_cfg[2].cfg);
//	
//	
//}

//static rt_err_t stm32_re_configure(struct rt_serial_device *serial, struct serial_configure *cfg)
//{
//    struct stm32_uart* uart;
//    USART_InitTypeDef USART_InitStructure;

//    RT_ASSERT(serial != RT_NULL);
//    RT_ASSERT(cfg != RT_NULL);

//    uart = (struct stm32_uart *)serial->parent.user_data;
//	
//		
//		if (uart->uart_device == USART1)
//		{
//			serial_cfg[0].flag = 1;
//			serial_cfg[0].device = serial;
//			serial_cfg[0].cfg = cfg;
//			
//		}
//		if (uart->uart_device == USART2)
//		{
//			serial_cfg[1].flag = 1;
//			serial_cfg[1].device = serial;
//			serial_cfg[1].cfg = cfg;
//		}
//		if (uart->uart_device == USART3)
//		{
//			serial_cfg[2].flag = 1;
//			serial_cfg[2].device = serial;
//			serial_cfg[2].cfg = cfg;
//		}
//	

//    USART_InitStructure.USART_BaudRate = cfg->baud_rate;

//    if (cfg->data_bits == DATA_BITS_8)
//        USART_InitStructure.USART_WordLength = USART_WordLength_8b;

