ld3003/easyio/bsp/EasyIO_stm32l1xx/drivers/bootloader_usart.c
//    if (cfg->stop_bits == STOP_BITS_1)
//        USART_InitStructure.USART_StopBits = USART_StopBits_1;
//    else if (cfg->stop_bits == STOP_BITS_2)
//        USART_InitStructure.USART_StopBits = USART_StopBits_2;

//    USART_InitStructure.USART_Parity = USART_Parity_No;
//    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
//		//如果是Uart3 则开启流控
//		if (uart->uart_device == USART3)
//		{
//			USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
//		}
//		
//    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
//    USART_Init(uart->uart_device, &USART_InitStructure);

//		/* Enable USART */
//    USART_Cmd(uart->uart_device, ENABLE);
//		

//		if (uart->uart_device == USART1)
//		{
//			/* enable interrupt */
//			USART_ITConfig(uart->uart_device, USART_IT_RXNE, ENABLE);
//		}
//		
//				//disable rx interrupt
//		if (uart->uart_device == USART3)
//		{
//			uart3dev = serial;
//			if (UART3_USE_DMA == 1)
//			{
//				init_uart3_dma();
//				USART_ITConfig(uart->uart_device, USART_IT_RXNE, DISABLE);
//			}else{
//				USART_ITConfig(uart->uart_device, USART_IT_RXNE, ENABLE);
//			}
//		}
//		
//		
//		
//		//disable rx interrupt
//		if (uart->uart_device == USART2)
//		{
//			uart2dev = serial;
//			
//			if (UART2_USE_DMA == 1)
//			{
//				init_uart2_dma();
//				USART_ITConfig(uart->uart_device, USART_IT_RXNE, ENABLE);
//			}else
//			{
//				USART_ITConfig(uart->uart_device, USART_IT_RXNE, ENABLE);
//			}
//		}
//		
//		
//    return RT_EOK;
//}


static rt_err_t stm32_configure(struct rt_serial_device *serial, struct serial_configure *cfg)
{
    struct stm32_uart* uart;
    USART_InitTypeDef USART_InitStructure;

    RT_ASSERT(serial != RT_NULL);
    RT_ASSERT(cfg != RT_NULL);

    uart = (struct stm32_uart *)serial->parent.user_data;
	
		
		if (uart->uart_device == USART1)
		{
			serial_cfg[0].flag = 1;
			serial_cfg[0].device = serial;
			serial_cfg[0].cfg = cfg;
			
		}
		if (uart->uart_device == USART2)
		{
			serial_cfg[1].flag = 1;
			serial_cfg[1].device = serial;
			serial_cfg[1].cfg = cfg;
		}
		if (uart->uart_device == USART3)
		{
			serial_cfg[2].flag = 1;
			serial_cfg[2].device = serial;
			serial_cfg[2].cfg = cfg;
		}
	

    USART_InitStructure.USART_BaudRate = cfg->baud_rate;

    if (cfg->data_bits == DATA_BITS_8)
        USART_InitStructure.USART_WordLength = USART_WordLength_8b;

    if (cfg->stop_bits == STOP_BITS_1)
        USART_InitStructure.USART_StopBits = USART_StopBits_1;
    else if (cfg->stop_bits == STOP_BITS_2)
        USART_InitStructure.USART_StopBits = USART_StopBits_2;

    USART_InitStructure.USART_Parity = USART_Parity_No;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
		//如果是Uart3则开启流控
		if (uart->uart_device == USART3)
		{
			USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
		}
    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
    USART_Init(uart->uart_device, &USART_InitStructure);
		

    /* Enable USART */
    USART_Cmd(uart->uart_device, ENABLE);
		

		if (uart->uart_device == USART1)
		{
			USART_ITConfig(uart->uart_device, USART_IT_RXNE, ENABLE);
		}
		
		
		
		//disable rx interrupt
		if (uart->uart_device == USART3)
		{
			
			uart3dev = serial;
			if(UART3_USE_DMA == 1)
			{
				init_uart3_dma();
				init_uart3_dma_tmr();
				USART_ITConfig(uart->uart_device, USART_IT_RXNE, DISABLE);
			}else{
				init_uart3_dma_tmr();
				USART_ITConfig(uart->uart_device, USART_IT_RXNE, ENABLE);
			}
		}
		
		
		
		//disable rx interrupt
		if (uart->uart_device == USART2)
		{
			
			uart2dev = serial;
			if(UART2_USE_DMA == 1)
			{
				init_uart2_dma();
				init_uart2_dma_tmr();
				USART_ITConfig(uart->uart_device, USART_IT_RXNE, ENABLE);
			}else{
				/* enable interrupt */
				USART_ITConfig(uart->uart_device, USART_IT_RXNE, ENABLE);
				init_uart2_it_tmr();
			}
		}
		

    return RT_EOK;
}

static rt_err_t stm32_control(struct rt_serial_device *serial, int cmd, void *arg)
{
    struct stm32_uart* uart;

    RT_ASSERT(serial != RT_NULL);
    uart = (struct stm32_uart *)serial->parent.user_data;

    switch (cmd)
    {
    case RT_DEVICE_CTRL_CLR_INT:
        /* disable rx irq */
        UART_DISABLE_IRQ(uart->irq);
        break;
    case RT_DEVICE_CTRL_SET_INT:
        /* enable rx irq */
        UART_ENABLE_IRQ(uart->irq);
        break;
    }

    return RT_EOK;
}

static int stm32_putc(struct rt_serial_device *serial, char c)
{
    struct stm32_uart* uart;

    RT_ASSERT(serial != RT_NULL);
    uart = (struct stm32_uart *)serial->parent.user_data;

    while (!(uart->uart_device->SR & USART_FLAG_TXE));
    uart->uart_device->DR = c;

    return 1;
}

static int stm32_getc(struct rt_serial_device *serial)
{
    int ch;
    struct stm32_uart* uart;

    RT_ASSERT(serial != RT_NULL);
    uart = (struct stm32_uart *)serial->parent.user_data;

    ch = -1;
    if (uart->uart_device->SR & USART_FLAG_RXNE)
    {
        ch = uart->uart_device->DR & 0xff;
    }

    return ch;
}

static const struct rt_uart_ops stm32_uart_ops =
{
    stm32_configure,
    stm32_control,
    stm32_putc,
    stm32_getc,
};

#if defined(RT_USING_UART1)
/* UART1 device driver structure */
struct serial_ringbuffer uart1_int_rx;
struct stm32_uart uart1 =
{
    USART1,
    USART1_IRQn,
};
struct rt_serial_device serial1;

void USART1_IRQHandler(void)
{
    struct stm32_uart* uart;

    uart = &uart1;

    /* enter interrupt */
    rt_interrupt_enter();
    if(USART_GetITStatus(uart->uart_device, USART_IT_RXNE) != RESET)
    {
        rt_hw_serial_isr(&serial1);
        /* clear interrupt */
        USART_ClearITPendingBit(uart->uart_device, USART_IT_RXNE);
    }
    if (USART_GetITStatus(uart->uart_device, USART_IT_TC) != RESET)
    {
        /* clear interrupt */
        USART_ClearITPendingBit(uart->uart_device, USART_IT_TC);
    }

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* RT_USING_UART1 */

#if defined(RT_USING_UART2)
/* UART1 device driver structure */
struct serial_ringbuffer uart2_int_rx;
struct stm32_uart uart2 =
{
    USART2,
    USART2_IRQn,
};
struct rt_serial_device serial2;
void USART2_IRQHandler(void)
{
    struct stm32_uart* uart;

    uart = &uart2;

    /* enter interrupt */
    rt_interrupt_enter();
    if(USART_GetITStatus(uart->uart_device, USART_IT_RXNE) != RESET)
    {
				if(UART2_USE_DMA == 0)
				{
					//收到的数据往缓冲区里面放
					if (uart2_recv_length < BUFFER_LEN)
					{
						Uart2_Rx[uart2_recv_length++] = serial2.ops->getc(&serial2);
					}
					//rt_hw_serial_isr(&serial2);
				}
        /* clear interrupt */
        USART_ClearITPendingBit(uart->uart_device, USART_IT_RXNE);
    }
    if (USART_GetITStatus(uart->uart_device, USART_IT_TC) != RESET)
    {
        USART_ClearITPendingBit(uart->uart_device, USART_IT_TC);
    }
		
		if (USART_GetITStatus(uart->uart_device, USART_IT_IDLE) != RESET)
    {
				USART_ClearITPendingBit(uart->uart_device, USART_IT_IDLE);
    }
		
