ld3003/easyio/bsp/EasyIO_stm32l1xx/drivers/bootloader_usart.c
		if (USART_GetITStatus(uart->uart_device, USART_IT_CTS) != RESET)
    {
				USART_ClearITPendingBit(uart->uart_device, USART_IT_CTS);
    }
		
		if (USART_GetITStatus(uart->uart_device, USART_IT_LBD) != RESET)
    {  
				USART_ClearITPendingBit(uart->uart_device, USART_IT_LBD);
    }
		
		 if (USART_GetFlagStatus(USART2, USART_FLAG_ORE) != RESET)    //接收溢出中断
     {


       (u16)(USART2->DR & (u16)0x01FF);   
     }


    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* RT_USING_UART2 */

#if defined(RT_USING_UART3)
/* UART1 device driver structure */
struct serial_ringbuffer uart3_int_rx;
struct stm32_uart uart3 =
{
    USART3,
    USART3_IRQn,
};
struct rt_serial_device serial3;

void USART3_IRQHandler(void)
{
		unsigned int temp;
    struct stm32_uart* uart;

    uart = &uart3;

    /* enter interrupt */
    rt_interrupt_enter();
	
    if(USART_GetITStatus(uart->uart_device, USART_IT_RXNE) != RESET)
    {
				if(UART3_USE_DMA == 0)
				{
					rt_hw_serial_isr(&serial3);
				}
        USART_ClearITPendingBit(uart->uart_device, USART_IT_RXNE);
    }
    if (USART_GetITStatus(uart->uart_device, USART_IT_TC) != RESET)
    {
        USART_ClearITPendingBit(uart->uart_device, USART_IT_TC);
    }
		
		if (USART_GetITStatus(uart->uart_device, USART_IT_IDLE) != RESET)
    {
				USART_ClearITPendingBit(uart->uart_device, USART_IT_IDLE);
    }
		
		if (USART_GetITStatus(uart->uart_device, USART_IT_CTS) != RESET)
    {
				USART_ClearITPendingBit(uart->uart_device, USART_IT_CTS);
    }
		
		if (USART_GetITStatus(uart->uart_device, USART_IT_LBD) != RESET)
    {  
				USART_ClearITPendingBit(uart->uart_device, USART_IT_LBD);
    }
		
		if (USART_GetFlagStatus(USART3, USART_FLAG_ORE) != RESET)    //接收溢出中断
     {


       (u16)(USART2->DR & (u16)0x01FF);   
     }
		
    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* RT_USING_UART3 */

static void RCC_Configuration(void)
{
	
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA,ENABLE);
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB,ENABLE);
	
#ifdef RT_USING_UART1
    /* Enable UART GPIO clocks */
    RCC_APB2PeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);
    /* Enable UART clock */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
#endif /* RT_USING_UART1 */

#ifdef RT_USING_UART2
    /* Enable UART GPIO clocks */
    RCC_APB2PeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);
    /* Enable UART clock */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
#endif /* RT_USING_UART2 */

#ifdef RT_USING_UART3
    /* Enable UART GPIO clocks */
    RCC_APB1PeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);
    /* Enable UART clock */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
#endif /* RT_USING_UART3 */
}

static void GPIO_Configuration(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;
	
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
		GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
		GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; 

#ifdef RT_USING_UART1
	
		/* Connect PXx to USARTx_Tx */
		GPIO_PinAFConfig(GPIOA, GPIO_PinSource9,GPIO_AF_USART1);//PA9-TX 
		/* Connect PXx to USARTx_Rx */
		GPIO_PinAFConfig(GPIOA,GPIO_PinSource10,GPIO_AF_USART1);//PA10-RX
	
    /* Configure USART Rx/tx PIN */
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Pin = UART1_GPIO_RX;
    GPIO_Init(UART1_GPIO, &GPIO_InitStructure);

    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Pin = UART1_GPIO_TX;
    GPIO_Init(UART1_GPIO, &GPIO_InitStructure);
	
	
#endif /* RT_USING_UART1 */

#ifdef RT_USING_UART2

		/* Connect PXx to USARTx_Tx */
		GPIO_PinAFConfig(GPIOA, GPIO_PinSource2,GPIO_AF_USART2);//PA2-TX 

		/* Connect PXx to USARTx_Rx */
		GPIO_PinAFConfig(GPIOA, GPIO_PinSource3,GPIO_AF_USART2);//PA3-RX

    /* Configure USART Rx/tx PIN */
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Pin = UART2_GPIO_RX;
    GPIO_Init(UART2_GPIO, &GPIO_InitStructure);

		
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Pin = UART2_GPIO_TX;
    GPIO_Init(UART2_GPIO, &GPIO_InitStructure);
#endif /* RT_USING_UART2 */

#ifdef RT_USING_UART3


		/* Connect PXx to USARTx_Tx */
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource10,GPIO_AF_USART3);//PB10-TX 

		/* Connect PXx to USARTx_Rx */
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource11,GPIO_AF_USART3);//PB11-RX
		
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource13,GPIO_AF_USART3);//PB11-RX
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource14,GPIO_AF_USART3);//PB11-RX

    /* Configure USART Rx/tx PIN */
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Pin = UART3_GPIO_RX;
    GPIO_Init(UART3_GPIO, &GPIO_InitStructure);

    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Pin = UART3_GPIO_TX;
    GPIO_Init(UART3_GPIO, &GPIO_InitStructure);

		
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Pin = UART3_GPIO_RTS;
    GPIO_Init(UART3_GPIO, &GPIO_InitStructure);
		
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Pin = UART3_GPIO_CTS;
    GPIO_Init(UART3_GPIO, &GPIO_InitStructure);

		
#endif /* RT_USING_UART3 */
}

static void NVIC_Configuration(struct stm32_uart* uart)
{
    NVIC_InitTypeDef NVIC_InitStructure;

    /* Enable the USART1 Interrupt */
    NVIC_InitStructure.NVIC_IRQChannel = uart->irq;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}

void rt_hw_usart_init(void)
{
    struct stm32_uart* uart;
    struct serial_configure config = RT_SERIAL_CONFIG_DEFAULT;

    RCC_Configuration();
    GPIO_Configuration();

#ifdef RT_USING_UART1
    uart = &uart1;
    config.baud_rate = BAUD_RATE_115200;

    serial1.ops    = &stm32_uart_ops;
    serial1.int_rx = &uart1_int_rx;
    serial1.config = config;

    NVIC_Configuration(&uart1);

    /* register UART1 device */
    rt_hw_serial_register(&serial1, "uart1",
                          RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX | RT_DEVICE_FLAG_STREAM,
                          uart);
#endif /* RT_USING_UART1 */

#ifdef RT_USING_UART2
    uart = &uart2;

    config.baud_rate = BAUD_RATE_9600;

    serial2.ops    = &stm32_uart_ops;
    serial2.int_rx = &uart2_int_rx;
    serial2.config = config;

    NVIC_Configuration(&uart2);

    /* register UART1 device */
    rt_hw_serial_register(&serial2, "uart2",
                          RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX,
                          uart);
#endif /* RT_USING_UART2 */

#ifdef RT_USING_UART3
    uart = &uart3;
		
    config.baud_rate = BAUD_RATE_115200;

    serial3.ops    = &stm32_uart_ops;
    serial3.int_rx = &uart3_int_rx;
    serial3.config = config;

    NVIC_Configuration(&uart3);

    /* register UART1 device */
    rt_hw_serial_register(&serial3, "uart3",
                          RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX,
                          uart);
#endif /* RT_USING_UART3 */
}
